[nagios - Host Down Notifications - Last 60 minutes]
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = `nagios_index` `nagios_core_sourcetype` eventname="HOST NOTIFICATION" status_code=DOWN | dedup status_code host_name | top status_code by host_name limit="10" | fields - percent

[nagios - Service Notifications with state Critical - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
request.ui_dispatch_view = search
search = `nagios_index` `nagios_core_sourcetype` eventname="SERVICE NOTIFICATION" status_code=CRITICAL | dedup service src_host

[nagios - Scheduled Downtime by host and service - Last 24 Hours]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
request.ui_dispatch_view = search
search = `nagios_index` `nagios_core_sourcetype` eventtype=nagios_service_downtime_alert | transaction host_name service startswith=STARTED endswith=STOPPED maxpause=-1 maxspan=-1

[nagios - Number of Alerts - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
request.ui_dispatch_view = search
search = `nagios_index` `nagios_core_sourcetype` (eventname="SERVICE NOTIFICATION" status_code="WARNING" OR status_code="CRITICAL") OR (eventname="HOST NOTIFICATION" status_code="DOWN")

[nagios - Host or Service Alerts - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
request.ui_dispatch_view = search
alert.digest_mode = True
auto_summarize.dispatch.earliest_time = -1d@h
search = `nagios_index` `nagios_core_sourcetype` (eventname="SERVICE ALERT" NOT status_code="OK") OR (eventname="HOST ALERT" status_code="DOWN")

[nagios - Lookup All Devices - CMDB]
action.email.reportServerEnabled = 0
alert.track = 1
dispatch.earliest_time = 0
dispatch.latest_time = now
request.ui_dispatch_view = search
search = | stats count | livehoststatus 9999 all | mvexpand livehoststatus_results | rex field=livehoststatus_results "(?<host_name>.*);(?<src_ip>.*);(?<description>.*);(?<livehoststatus>.*)" | table host_name src_ip livehoststatus description | sort host_name

#Version 4
[Nagios - Top 100 Alerts]
action.email.reportServerEnabled = 0
dispatch.earliest_time = -7d@d
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = `nagios_index` `nagios_core_sourcetype` host_name="*" ((eventname="SERVICE ALERT" NOT status_code="OK") OR \
(eventname="HOST ALERT" NOT status_code="UP")) \
| eval name=if(eventname=="HOST ALERT","Host",service) \
| top eventname,host_name,name limit="100"

[Nagios Host Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| livehostgroups\
| mvexpand livehostgroups_results\
| rex field=livehostgroups_results "(?<hostgroup>[^;]*);(?<num_hosts>[^;]*);(?<num_hosts_down>[^;]*);(?<num_hosts_pending>[^;]*);(?<num_hosts_unreach>[^;]*);(?<num_hosts_up>[^;]*);(?<num_services>[^;]*);(?<num_services_crit>[^;]*);(?<num_services_hard_crit>[^;]*);(?<num_services_hard_ok>[^;]*);(?<num_services_hard_unknown>[^;]*);(?<num_services_hard_warn>[^;]*);(?<num_services_ok>[^;]*);(?<num_services_pending>[^;]*);(?<num_services_unknown>[^;]*);(?<num_services_warn>[^;]*);(?<worst_host_state>[^;]*);(?<worst_service_hard_state>[^;]*);(?<worst_service_state>[^;]*)"\
| eval host_perc=(num_hosts_up/num_hosts)*100\
| eval host_perc=if(isnull(host_perc),"N/A: empty hostgroup",host_perc)\
| eval service_perc=(num_services_ok/num_services)*100\
| eval service_perc=if(isnull(service_perc),"N/A: empty servicegroup",service_perc)\
| table hostgroup num_hosts_up num_hosts host_perc num_services_ok num_services service_perc

[Nagios Service Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| liveservicegroups\
| mvexpand liveservicegroups_results\
| rex field=liveservicegroups_results "(?<servicegroup>[^;]*);(?<num_services>[^;]*);(?<num_services_crit>[^;]*);(?<num_services_hard_crit>[^;]*);(?<num_services_hard_ok>[^;]*);(?<num_services_hard_unknown>[^;]*);(?<num_services_hard_warn>[^;]*);(?<num_services_ok>[^;]*);(?<num_services_pending>[^;]*);(?<num_services_unknown>[^;]*);(?<num_services_warn>[^;]*);(?<worst_service_state>.*)"\
| eval service_perc=(num_services_ok/num_services)*100\
| eval service_perc=if(isnull(service_perc),"N/A: empty servicegroup",service_perc)\
| table servicegroup num_services_ok num_services service_perc\
| sort servicegroup

[Host Status for all Host Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| livehostgroupstatus\
| mvexpand livehoststatus_results\
| rex field=livehoststatus_results "((?<host_name>.*)\|(?<livehoststatus>.*)\|(?<num>.*)|)\|(?<hostgroup>.*)"\
| eval host_name=if(isnull(host_name),"N/A: empty hostgroup",host_name)\
| eval livehoststatus=if(isnull(livehoststatus),"N/A: empty hostgroup",livehoststatus)\
| table hostgroup host_name livehoststatus \
| sort hostgroup,host_name

[Service Status for all Service Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| liveservicegroupstatus\
| mvexpand liveservicestatus_results\
| rex field=liveservicestatus_results "((?<host_name>.*)\|(?<service>.*)\|(?<liveservicestatus>.*)\|(?<num>.*)|)\|(?<servicegroup>.*)"\
| eval host_name=if(isnull(host_name),"N/A: empty servicegroup",host_name)\
| eval service=if(isnull(service),"N/A: empty servicegroup",service)\
| eval liveservicestatus=if(isnull(liveservicestatus),"N/A: empty servicegroup",liveservicestatus)\
| table servicegroup host_name service liveservicestatus \
| sort servicegroup,host_name,service

