[nagios - Host Down Notifications - Last 60 minutes]
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = index=nagios nagiosevent="HOST NOTIFICATION" hostnotificationstatus="DOWN" | dedup hostnotificationstatus hostnotification | top hostnotificationstatus by hostnotification limit="10" | fields +  hostnotification hostnotificationstatus count
vsid = *:gaz2l4kh

[nagios - Service Notifications with state Critical - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=nagios nagiosevent="SERVICE NOTIFICATION" severity="CRITICAL" | dedup name src_host
vsid = gaz2b3br

[nagios - Scheduled Downtime by host and service - Last 24 Hours]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index="nagios" eventtype="servicedowntimest*" src_host="*" | transaction src_host name startswith="eventtype=servicedowntimestart" endswith="eventtype=servicedowntimestop" maxpause=-1 maxspan=-1
vsid = gaz3kjaf

[nagios - Number of Alerts - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
alert.digest_mode = True
auto_summarize.dispatch.earliest_time = -1d@h
search = index="nagios" (nagiosevent="SERVICE ALERT" severity="WARNING" OR severity="CRITICAL") OR (nagiosevent="HOST ALERT" hoststatus="DOWN") | stats count
vsid = gaz2t17n

[nagios - Host or Service Notifications - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=nagios (nagiosevent="SERVICE NOTIFICATION" severity="WARNING" OR severity="CRITICAL") OR (nagiosevent="HOST NOTIFICATION" hostnotificationstatus="DOWN")
vsid = gaz1vim9

[nagios - Host or Service Alerts - Last 60 minutes]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
alert.digest_mode = True
auto_summarize.dispatch.earliest_time = -1d@h
search = index="nagios" (nagiosevent="SERVICE ALERT" severity="WARNING" OR severity="CRITICAL") OR (nagiosevent="HOST ALERT" hoststatus="DOWN")
vsid = gaz2w7we

[nagios - Lookup All Devices - CMDB]
action.email.reportServerEnabled = 0
alert.track = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = `HostAlert` | dedup host | livehoststatus | mvexpand livehoststatus_results | rex field=livehoststatus_results "(?<Host>.*);(?<src_ip>.*);(?<description>.*);(?<livehoststatus>.*)" | table Host src_ip livehoststatus description | sort Host
vsid = *:9b9bhnxr

[nagios - Create Server list based on Hostgroup]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = `CreateDeviceLookupByType(server, server.csv)`
vsid = ha32fqmh

[nagios - Create Cisco list based on Hostgroup]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = `CreateDeviceLookupByType(switches, switches.csv)`
vsid = ha32jlo2

#Version 4
[Nagios - Top 100 Alerts]
action.email.reportServerEnabled = 0
dispatch.earliest_time = -7d@d
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = `nagios_index` `nagios_core_sourcetype` host_name="*" ((eventname="SERVICE ALERT" NOT status_code="OK") OR \
(eventname="HOST ALERT" NOT status_code="UP")) \
| eval name=if(eventname=="HOST ALERT","Host",service) \
| top eventname,host_name,name limit="100"

[Nagios Host Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count \
| livehostgroups\
| mvexpand livehostgroups_results\
| rex field=livehostgroups_results "(?<hostgroup>[^;]*);(?<num_hosts>[^;]*);(?<num_hosts_down>[^;]*);(?<num_hosts_pending>[^;]*);(?<num_hosts_unreach>[^;]*);(?<num_hosts_up>[^;]*);(?<num_services>[^;]*);(?<num_services_crit>[^;]*);(?<num_services_hard_crit>[^;]*);(?<num_services_hard_ok>[^;]*);(?<num_services_hard_unknown>[^;]*);(?<num_services_hard_warn>[^;]*);(?<num_services_ok>[^;]*);(?<num_services_pending>[^;]*);(?<num_services_unknown>[^;]*);(?<num_services_warn>[^;]*);(?<worst_host_state>[^;]*);(?<worst_service_hard_state>[^;]*);(?<worst_service_state>[^;]*)"\
| eval host_perc=(num_hosts_up/num_hosts)*100\
| eval host_perc=if(isnull(host_perc),"N/A: empty hostgroup",host_perc)\
| eval service_perc=(num_services_ok/num_services)*100\
| eval service_perc=if(isnull(service_perc),"N/A: empty servicegroup",service_perc)\
| table hostgroup num_hosts_up num_hosts host_perc num_services_ok num_services service_perc

[Nagios Service Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| liveservicegroups\
| mvexpand liveservicegroups_results\
| rex field=liveservicegroups_results "(?<servicegroup>[^;]*);(?<num_services>[^;]*);(?<num_services_crit>[^;]*);(?<num_services_hard_crit>[^;]*);(?<num_services_hard_ok>[^;]*);(?<num_services_hard_unknown>[^;]*);(?<num_services_hard_warn>[^;]*);(?<num_services_ok>[^;]*);(?<num_services_pending>[^;]*);(?<num_services_unknown>[^;]*);(?<num_services_warn>[^;]*);(?<worst_service_state>.*)"\
| eval service_perc=(num_services_ok/num_services)*100\
| eval service_perc=if(isnull(service_perc),"N/A: empty servicegroup",service_perc)\
| table servicegroup num_services_ok num_services service_perc\
| sort servicegroup

[Host Status for all Host Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| livehostgroupstatus\
| mvexpand livehoststatus_results\
| rex field=livehoststatus_results "((?<host_name>.*)\|(?<livehoststatus>.*)\|(?<num>.*)|)\|(?<hostgroup>.*)"\
| eval host_name=if(isnull(host_name),"N/A: empty hostgroup",host_name)\
| eval livehoststatus=if(isnull(livehoststatus),"N/A: empty hostgroup",livehoststatus)\
| table hostgroup host_name livehoststatus \
| sort hostgroup,host_name

[Service Status for all Service Groups]
alert.digest_mode = 1
dispatch.earliest_time = 0
dispatch.latest_time = 
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_view = search
search = | stats count\
| liveservicegroupstatus\
| mvexpand liveservicestatus_results\
| rex field=liveservicestatus_results "((?<host_name>.*)\|(?<service>.*)\|(?<liveservicestatus>.*)\|(?<num>.*)|)\|(?<servicegroup>.*)"\
| eval host_name=if(isnull(host_name),"N/A: empty servicegroup",host_name)\
| eval service=if(isnull(service),"N/A: empty servicegroup",service)\
| eval liveservicestatus=if(isnull(liveservicestatus),"N/A: empty servicegroup",liveservicestatus)\
| table servicegroup host_name service liveservicestatus \
| sort servicegroup,host_name,service

